// 导航站 https://dl.kkys01.com/
var rule={
    title:'可可影视',
    host:'http://www.kkys01.com',
    homeUrl: '/',
    //host:'https://dl.kkys01.com/',
   // hostJs:'print(HOST);let html=request(HOST,{headers:{"User-Agent":PC_UA}});let src=jsp.pdfh(html,"#good&&li:eq(0)&&a&&href");print(src);HOST=src',
    // url:'/whole/fyclass_______0_addtime_fypage.html',
    url:'/show/fyfilter.html',
    filterable:1,//是否启用分类筛选,
    filter_url:'{{fl.cateId}}-{{fl.class}}-{{fl.area}}-{{fl.lang}}-{{fl.year}}-{{fl.by}}-fypage',//{{fl.cateId}}-{{fl.class}}-{{fl.area}}-{{fl.lang}}-{{fl.year}}-{{fl.by}}-fypage
    filter:{
        "1":[{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"10年代","v":"10年代"},{"n":"00年代","v":"00年代"},{"n":"90年代","v":"90年代"},{"n":"80年代","v":"80年代"},{"n":"更早","v":"更早"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"美国","v":"美国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"其他","v":"其他"}]},{"key":"class","name":"类型","value":[{"n":"全部","v":""},{"n":"警匪片","v":"警匪片"},{"n":"恐怖片","v":"恐怖片"},{"n":"惊悚片","v":"惊悚片"},{"n":"悬疑片","v":"悬疑片"},{"n":"科幻片","v":"科幻片"},{"n":"战争片","v":"战争片"},{"n":"动作片","v":"动作片"},{"n":"喜剧片","v":"喜剧片"},{"n":"爱情片","v":"爱情片"},{"n":"微电影","v":"微电影"},{"n":"纪录片","v":"纪录片"},{"n":"剧情片","v":"剧情片"},{"n":"其他片","v":"其他片"}]},{"key":"by","name":"排序","value":[{"n":"综合","v":"综合"},{"n":"最新","v":"最新"},{"n":"最热","v":"最热"}]}],
        "2":[{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"10年代","v":"10年代"},{"n":"00年代","v":"00年代"},{"n":"90年代","v":"90年代"},{"n":"80年代","v":"80年代"},{"n":"更早","v":"更早"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"美国","v":"美国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"其他","v":"其他"}]},{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"国产剧","v":"国产剧"},{"n":"日韩剧","v":"日韩剧"},{"n":"欧美剧","v":"欧美剧"},{"n":"海外剧","v":"海外剧"}]},{"key":"by","name":"排序","value":[{"n":"综合","v":"综合"},{"n":"最新","v":"最新"},{"n":"最热","v":"最热"}]}],
        "3":[{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"10年代","v":"10年代"},{"n":"00年代","v":"00年代"},{"n":"90年代","v":"90年代"},{"n":"80年代","v":"80年代"},{"n":"更早","v":"更早"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"美国","v":"美国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"其他","v":"其他"}]},{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"国产动漫","v":"国产动漫"},{"n":"日韩动漫","v":"日韩动漫"},{"n":"欧美动漫","v":"欧美动漫"},{"n":"动画片","v":"动画片"},{"n":"动漫片","v":"动漫片"}]},{"key":"by","name":"排序","value":[{"n":"综合","v":"综合"},{"n":"最新","v":"最新"},{"n":"最热","v":"最热"}]}],
        "4":[{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"2025"},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"10年代","v":"10年代"},{"n":"00年代","v":"00年代"},{"n":"90年代","v":"90年代"},{"n":"80年代","v":"80年代"},{"n":"更早","v":"更早"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"其他","v":"其他"}]},{"key":"class","name":"类型","value":[{"n":"全部","v":""},{"n":"犯罪","v":"犯罪"},{"n":"纪录","v":"纪录"},{"n":"短片","v":"短片"},{"n":"真人秀","v":"真人秀"},{"n":"搞笑","v":"搞笑"},{"n":"晚会","v":"晚会"},{"n":"历史","v":"历史"},{"n":"喜剧","v":"喜剧"},{"n":"传记","v":"传记"},{"n":"相声","v":"相声"},{"n":"歌舞","v":"歌舞"},{"n":"冒险","v":"冒险"},{"n":"运动","v":"运动"},{"n":"Season","v":"Season"}]},{"key":"by","name":"排序","value":[{"n":"综合","v":"综合"},{"n":"最新","v":"最新"},{"n":"最热","v":"最热"}]}],
        "6":[{"key":"class","name":"类型","value":[{"n":"全部","v":""},{"n":"王爷太子","v":"王爷太子"},{"n":"霸道总裁","v":"霸道总裁"},{"n":"屌丝逆袭","v":"屌丝逆袭"},{"n":"赘婿系列","v":"赘婿系列"},{"n":"重生系列","v":"重生系列"},{"n":"穿越短剧","v":"穿越短剧"},{"n":"美女总裁","v":"美女总裁"},{"n":"娇妻系列","v":"娇妻系列"},{"n":"龙王系列","v":"龙王系列"},{"n":"龙王系列","v":"龙王系列"}]},{"key":"by","name":"排序","value":[{"n":"综合","v":"综合"},{"n":"最新","v":"最新"},{"n":"最热","v":"最热"}]}]},
        filter_def:{
        1:{cateId:'1'},
        2:{cateId:'2'},
        4:{cateId:'4'},
        3:{cateId:'3'},
        6:{cateId:'6'}
    },
    searchUrl:'search?t=yuPmbB0ihZS33T76sZjwHg%3D%3D&k=**',
    searchable:2,//是否启用全局搜索,
    quickSearch:0,//是否启用快速搜索,
    headers:{
        'User-Agent':'PC_UA'
    },
    //class_parse: '.nav-box&&.swiper-slide;a&&Text;a&&href;/(\\d+).html',
    class_name: '电影&剧集&动漫&综艺记录&短剧',
    class_url: '1&2&3&4&6',

    play_parse:true,
    lazy:'',
    limit:6,
    推荐:'*',
    //'body&&.module-item;.v-item-title:eq(1)&&Text;img:eq(-1)&&date-original;.span&&Text;a&&href',
    //一级:'body&&.module-item;.v-item-title:eq(1)&&Text;img:eq(1)&&date-original;.span&&Text;a&&href',
    一级:`js:
pdfh=jsp.pdfh;pdfa=jsp.pdfa;pd=jsp.pd;
let d = [];
let html = request(input);
let list = pdfa(html, 'body&&.module-item');
list.forEach(it => {
	d.push({
		title: pdfh(it, '.v-item-title:eq(-2)&&Text'),
		desc: pdfh(it, 'span&&Text'),
		pic_url: pd(it, 'img:eq(0)&&date-original'),
		url: pd(it, 'a&&href')
	});
});
setResult(d);
	`,
    二级:{
        "title":"h1--span&&Text;tr:eq(2)&&a&&Text",
        "img":".img-thumbnail&&src",
        "desc":"tr:eq(6)&&a&&Text;;;#casts&&Text;tr:eq(0)&&a&&Text",
        "content":".detail-desc p&&Text",
        "tabs":".source-box&&span",
        "lists":".episode-box-main&&.episode-list&&a"
    },
    搜索:'body&&.search-result-item-ctn;.title&&Text;img:eq(1)&&date-original;.span&&Text;a&&href',
}
