var rule = {
    title: '大米影视',
    host: 'https://www.dmdh.cc',
    url: '/vodshow/fyfilter.html',
    filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.by or "time"}}-{{fl.class}}-{{fl.lang}}-{{fl.letter}}---fypage---{{fl.year}}',
    searchUrl: '/vodshow/fyclass--------fypage---.html',
    headers: {
        'User-Agent': 'MOBILE_UA'
    },
    searchable: 2, //是否启用全局搜索,
    quickSearch: 0, //是否启用快速搜索,
    filterable: 1, //是否启用分类筛选,
    class_parse: '.nav&&ul&&li;a&&Text;a&&href;.*/(.*?).html',
        filter: {
        "1": [ 
                { "key": "cateId", "name": "类型", "value": [
                { "n": "全部", "v": "1" },{ "n": "动作片", "v": "6" },{ "n": "喜剧片", "v": "7" },{ "n": "爱情片", "v": "8" },
                { "n": "科幻片", "v": "9" },{ "n": "恐怖片", "v": "10" },{ "n": "剧情片", "v": "11" },{ "n": "战争片", "v": "12" }
             ] },
            { "key": "area", "name": "地区", "value": [
                { "n": "全部", "v": "" },{ "n": "内地", "v": "内地" },{ "n": "香港", "v": "香港" },{ "n": "台湾", "v": "台湾" },
                { "n": "美国", "v": "美国" }, { "n": "韩国", "v": "韩国" },{ "n": "日本", "v": "日本" },{ "n": "泰国", "v": "泰国" },
                { "n": "新加坡", "v": "新加坡" },{ "n": "印度", "v": "印度" },{ "n": "英国", "v": "英国" },{ "n": "法国", "v": "法国" },
                { "n": "加拿大", "v": "加拿大" }, { "n": "欧美", "v": "欧美" },{ "n": "其他", "v": "其他" }
            ] },
            { "key": "year", "name": "字母", "value": [
                { "n": "全部", "v": "" },{ "n": "2025", "v": "2025" },{ "n": "2024", "v": "2024" },{ "n": "2023", "v": "2023" },
                { "n": "2022", "v": "2022" },{ "n": "2021", "v": "2021" },{ "n": "2020", "v": "2020" },{ "n": "2019", "v": "2019" },
                { "n": "2018", "v": "2018" },{ "n": "2017", "v": "2017" },{ "n": "2016", "v": "2016" },{ "n": "2015", "v": "2015" },
                { "n": "2014", "v": "2014" },{ "n": "2013", "v": "2013" },{ "n": "2012", "v": "2012" },{ "n": "2011", "v": "2011" },
                { "n": "2010", "v": "2010" }
            ] },
            { "key": "letter", "name": "", "value": [
                { "n": "全部", "v": "" },{ "n": "A", "v": "A" },{ "n": "B", "v": "B" },{ "n": "C", "v": "C" },{ "n": "D", "v": "D" },
                { "n": "E", "v": "E" },{ "n": "F", "v": "F" },{ "n": "G", "v": "G" },{ "n": "H", "v": "H" },{ "n": "I", "v": "I" },
                { "n": "J", "v": "J" },{ "n": "K", "v": "K" },{ "n": "L", "v": "L" },{ "n": "M", "v": "M" },{ "n": "N", "v": "N" },
                { "n": "O", "v": "O" },{ "n": "P", "v": "P" },{ "n": "Q", "v": "Q" },{ "n": "R", "v": "R" },{ "n": "S", "v": "S" },
                { "n": "T", "v": "T" },{ "n": "U", "v": "U" },{ "n": "V", "v": "V" },{ "n": "W", "v": "W" },{ "n": "X", "v": "X" },
                { "n": "Y", "v": "Y" },{ "n": "Z", "v": "Z" },{ "n": "0-9", "v": "0-9" }
            ] },
            { "key": "by", "name": "排序", "value": [
                { "n": "最新", "v": "time" },{ "n": "最热", "v": "hits" },{ "n": "评分", "v": "score" }
            ] }
        ],
        "2": [ // 连续剧
            { "key": "cateId", "name": "类型", "value": [
                { "n": "全部", "v": "2" },{ "n": "国产剧", "v": "13" },{ "n": "港台剧", "v": "14" }, { "n": "日韩剧", "v": "15" },
                { "n": "欧美剧", "v": "16" }
            ] },
            { "key": "area", "name": "地区", "value": [
                { "n": "全部", "v": "" },{ "n": "内地", "v": "内地" },{ "n": "香港", "v": "香港" },{ "n": "台湾", "v": "台湾" },
                { "n": "韩国", "v": "韩国" },{ "n": "日本", "v": "日本" },{ "n": "美国", "v": "美国" },{ "n": "泰国", "v": "泰国" },
                { "n": "新加坡", "v": "新加坡" },{ "n": "印度", "v": "印度" },{ "n": "英国", "v": "英国" },{ "n": "法国", "v": "法国" },
                { "n": "加拿大", "v": "加拿大" },{ "n": "欧美", "v": "欧美" },{ "n": "其他", "v": "其他" }
            ] },
            { "key": "year", "name": "年份", "value": [
                { "n": "全部", "v": "" },{ "n": "2025", "v": "2025" },{ "n": "2024", "v": "2024" },{ "n": "2023", "v": "2023" },
                { "n": "2022", "v": "2022" },{ "n": "2021", "v": "2021" },{ "n": "2020", "v": "2020" },{ "n": "2019", "v": "2019" },
                { "n": "2018", "v": "2018" },{ "n": "2017", "v": "2017" },{ "n": "2016", "v": "2016" },{ "n": "2015", "v": "2015" },
                { "n": "2014", "v": "2014" },{ "n": "2013", "v": "2013" },{ "n": "2012", "v": "2012" },{ "n": "2011", "v": "2011" },
                { "n": "2010", "v": "2010" }
            ] },
            { "key": "letter", "name": "字母", "value": [
                { "n": "全部", "v": "" },{ "n": "A", "v": "A" },{ "n": "B", "v": "B" },{ "n": "C", "v": "C" },{ "n": "D", "v": "D" },
                { "n": "E", "v": "E" },{ "n": "F", "v": "F" },{ "n": "G", "v": "G" },{ "n": "H", "v": "H" },{ "n": "I", "v": "I" },
                { "n": "J", "v": "J" },{ "n": "K", "v": "K" },{ "n": "L", "v": "L" },{ "n": "M", "v": "M" },{ "n": "N", "v": "N" },
                { "n": "O", "v": "O" },{ "n": "P", "v": "P" },{ "n": "Q", "v": "Q" },{ "n": "R", "v": "R" },{ "n": "S", "v": "S" },
                { "n": "T", "v": "T" },{ "n": "U", "v": "U" },{ "n": "V", "v": "V" },{ "n": "W", "v": "W" },{ "n": "X", "v": "X" },
                { "n": "Y", "v": "Y" },{ "n": "Z", "v": "Z" },{ "n": "0-9", "v": "0-9" }
            ] },
            { "key": "by", "name": "排序", "value": [
                { "n": "最新", "v": "time" },{ "n": "最热", "v": "hits" },{ "n": "评分", "v": "score" }
            ] }
        ],
        "3": [ // 综艺
            { "key": "area", "name": "地区", "value": [
                { "n": "全部", "v": "" },{ "n": "内地", "v": "内地" },{ "n": "港台", "v": "港台" },{ "n": "日韩", "v": "日韩" },
                { "n": "欧美", "v": "欧美" }
            ] },
            { "key": "year", "name": "年份", "value": [
                { "n": "全部", "v": "" },{ "n": "2025", "v": "2025" },{ "n": "2024", "v": "2024" },{ "n": "2023", "v": "2023" },
                { "n": "2022", "v": "2022" },{ "n": "2021", "v": "2021" },{ "n": "2020", "v": "2020" },{ "n": "2019", "v": "2019" },
                { "n": "2018", "v": "2018" },{ "n": "2017", "v": "2017" },{ "n": "2016", "v": "2016" },{ "n": "2015", "v": "2015" },
                { "n": "2014", "v": "2014" },{ "n": "2013", "v": "2013" },{ "n": "2012", "v": "2012" },{ "n": "2011", "v": "2011" },
                { "n": "2010", "v": "2010" }
            ] },
            { "key": "by", "name": "排序", "value": [
                { "n": "最新", "v": "time" },{ "n": "最热", "v": "hits" },{ "n": "评分", "v": "score" }
            ] }
        ],
        "4": [ // 动漫
            { "key": "year", "name": "年份", "value": [
               { "n": "全部", "v": "" },{ "n": "2025", "v": "2025" },{ "n": "2024", "v": "2024" },{ "n": "2023", "v": "2023" },
                { "n": "2022", "v": "2022" },{ "n": "2021", "v": "2021" },{ "n": "2020", "v": "2020" },{ "n": "2019", "v": "2019" },
                { "n": "2018", "v": "2018" },{ "n": "2017", "v": "2017" },{ "n": "2016", "v": "2016" },{ "n": "2015", "v": "2015" },
                { "n": "2014", "v": "2014" },{ "n": "2013", "v": "2013" },{ "n": "2012", "v": "2012" },{ "n": "2011", "v": "2011" },
                { "n": "2010", "v": "2010" }
            ] },
            { "key": "lang", "name": "语言", "value": [
                { "n": "全部", "v": "" },{ "n": "国语", "v": "国语" },{ "n": "英语", "v": "英语" },{ "n": "粤语", "v": "粤语" },
                { "n": "韩语", "v": "韩语" },{ "n": "日语", "v": "日语" },{ "n": "其它", "v": "其它" }
            ] },
            { "key": "by", "name": "排序", "value": [
                { "n": "最新", "v": "time" },{ "n": "最热", "v": "hits" },{ "n": "评分", "v": "score" }
            ] }
        ]
    },

    filter_def: { 1: { cateId: '1' }, 2: { cateId: '2' }, 3: { cateId: '3' }, 4: { cateId: '4' } },
play_parse: true,
lazy:"js:var html=JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);var url=html.url;if(html.encrypt=='1'){url=unescape(url)}else if(html.encrypt=='2'){url=unescape(base64Decode(url))}if(/m3u8|mp4/.test(url)){input=url}else{input}",
limit: 6, 
推荐: '.module-list;.module-items&&.module-item;a&&title;img&&data-src;.module-item-text&&Text;a&&href',
double: true, // 推荐内容是否双层定位
一级: '.module-items&&.module-item;a&&title;img&&data-src;.module-item-text&&Text;a&&href', 
二级: {
    "title": "h1&&Text;.video-info-item:eq(1)&&Text",
    "img": ".module-item-pic&&img&&data-src",
    "desc": ".video-info-items:eq(0)&&Text;.video-info-items:eq(1)&&Text;.video-info-items:eq(2)&&Text;.video-info-items:eq(3)&&Text",
    "content": "Text",
    "tabs": ".module-tab-item .tab-item",
    "lists": ".module-list:eq(#id)&&.sort-item&&a"
}, 搜索: '.module-items&&.module-search-item;a&&title;img&&data-src;.video-info&&a&&Text;a&&href',
}
