var rule = {
    模板: '自动',
    title: 'xunlei8',
    host: 'https://xunlei8.cc/',
	headers: {'User-Agent': 'MOBILE_UA','cookie': 'PHPSESSID=irhqhr6891n9bvvld0dc4kop3o'},
	url: 'fyclass-fyfilter-date-fypage-30.html',
    filter_url:'{{fl.类型 or "0"}}-{{fl.年份 or "0"}}-{{fl.地区 or "0"}}',
	class_name: '电视剧&电影片',
	class_url: 'tv&list',
	searchUrl: '/s/**.html',
	searchable:2,
	quickSearch:0,
	filterable:1,
	play_parse:true,
	搜索:`body&&.bf3b11b08;h2.b586afc9&&title;a img&&src;;a&&href;;`,
    //一级: 'body&&.bc3ba;a&&title;img&&src;.b9b4a&&Text;a&&href',
	一级: 'div.bf3b11b08&&.b33c0;span.b355d4cd397&&Text;img&&src;span.b9b4a&&Text;a&&href',
    二级: {
        "title": ".b007 h1&&Text;.b044b3&&Text",
        "img": "img&&src",
        "desc": "p:eq(1)&&Text;p:eq(2)&&Text;p:eq(3)&&Text;p.b86e6c&&Text",
        "content": "p.b1f40f7888&&Text",
        tabs:'js:TABS = ["尤东风💠磁力"]',
		lists:`js:
		  log(TABS);
		  pdfh=jsp.pdfh;pdfa=jsp.pdfa;pd=jsp.pd;
		  LISTS = [];
				var d = pdfa(html, 'div.bf8243b9 ul&&a.baf6e960dd');
				d = d.map(function(it) {
					var title = pdfh(it, 'a[href^=thunder]&&Text');
					var burl = pd(it, 'a[href^=thunder]&&href');
					return title + '$' + burl
				});
				LISTS.push(d.reverse())//.reverse()倒序
		`, 
        },
    filter: 
	{
        "tv": [ 
			 {"key": "类型","name": "类型","value": 
			    [
				 {"n": "全部","v": "0"},{"n": "科幻","v": "科幻"},{"n": "悬疑","v": "悬疑"},{"n": "奇幻","v": "奇幻"},
				 {"n": "战争","v": "战争"},{"n": "动作","v": "动作"},{"n": "武侠","v": "武侠"},{"n": "犯罪","v": "犯罪"},
				 {"n": "纪录片","v": "纪录片"},{"n": "剧情","v": "剧情"},{"n": "冒险","v": "冒险"},{"n": "恐怖","v": "恐怖"},
				 {"n": "历史","v": "历史"},{"n": "动画","v": "动画"},{"n": "情色","v": "情色"},{"n": "家庭","v": "家庭"}
			    ]
			  },
			  {"key": "年份","name": "年份","value": 
			    [
				 {"n": "全部","v": "0"},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			    ]
			  },
			  {   "key":"地区","name":"地区","value":
			    [
				{"n":"全部","v":"0"},{"n":"美国","v":"美国"},{"n":"中国大陆","v":"中国大陆"},{"n":"韩国","v":"韩国"},
				{"n":"日本","v":"日本"},{"n":"英国","v":"英国"},
				{"n":"印度","v":"印度"},{"n":"法国","v":"法国"},{"n":"俄罗斯","v":"俄罗斯"},{"n":"加拿大","v":"加拿大"},
				{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},
				{"n":"西班牙","v":"西班牙"},{"n":"澳大利亚","v":"澳大利亚"},{"n":"意大利","v":"意大利"},
				{"n":"比利时","v":"比利时"},{"n":"中国台湾","v":"中国台湾"},
				{"n":"中国香港","v":"中国香港"}
				]
			  }	
	       ],
        "list": [ 
			   {"key": "类型","name": "类型","value": 
			    [
				 {"n": "全部","v": "0"},{"n": "科幻","v": "科幻"},{"n": "悬疑","v": "悬疑"},{"n": "奇幻","v": "奇幻"},
				 {"n": "战争","v": "战争"},{"n": "动作","v": "动作"},{"n": "武侠","v": "武侠"},{"n": "犯罪","v": "犯罪"},
				 {"n": "纪录片","v": "纪录片"},{"n": "剧情","v": "剧情"},{"n": "冒险","v": "冒险"},{"n": "恐怖","v": "恐怖"},
				 {"n": "历史","v": "历史"},{"n": "动画","v": "动画"},{"n": "情色","v": "情色"},{"n": "家庭","v": "家庭"}
			    ]
			  },
			   {"key": "year","name": "年份","value": 
			     [
				 {"n": "全部","v": "0"},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			     ]
			   },
			   {   "key":"地区","name":"地区","value":
			    [
				{"n":"地区","v":"0"},{"n":"美国","v":"美国"},{"n":"中国大陆","v":"中国大陆"},{"n":"韩国","v":"韩国"},
				{"n":"日本","v":"日本"},{"n":"英国","v":"英国"},
				{"n":"印度","v":"印度"},{"n":"法国","v":"法国"},{"n":"俄罗斯","v":"俄罗斯"},{"n":"加拿大","v":"加拿大"},
				{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},
				{"n":"西班牙","v":"西班牙"},{"n":"澳大利亚","v":"澳大利亚"},{"n":"意大利","v":"意大利"},
				{"n":"比利时","v":"比利时"},{"n":"中国台湾","v":"中国台湾"},
				{"n":"中国香港","v":"中国香港"}
				]
			  }	
	        ],
    },
}
