var rule = {
	title: '九月影视',
	host: 'https://www.ddzw.cn/',
	//url: '/vodshow/fyclass--------fypage---.html',
	url: '/vodshow/fyclassfyfilter.html',
	filterable: 1,
	filter_url: '---{{fl.class}}-----fypage---{{fl.year}}',
	class_name:'国产剧&电视剧&电影&综艺&动漫',
	class_url:'14&2&1&3&4',
	searchUrl: '/vodsearch/-------------.html?wd=**',
	searchable: 2,
	headers: {
		'User-Agent': 'PC_UA',
	},
	limit: 6,
	double: true, 
	一级: '.ys-list li;h5 b&&Text;img.lazyload&&data-original;.state em&&Text;a&&href',
	二级: {
		"title": "h1.article-subject&&Text;.tags&&Text",
		"img": ".thumb-wrap&&img&&src",
		"desc": ".s-top-info-title span&&Text;;;.item-type&&Text;.item-actor:eq(2)&&Text",
		"content": ".summary-con p:eq(1)&&Text",
		"tabs": ".swiper-wrapper:eq(1) .swiper-slide",
		"lists": ".episodes-list:eq(#id) li"
	},
	搜索: '.search-list li;h5 b&&Text;img.lazyload&&data-original;col-sm-9 p:eq(5)&&Text;a&&href',
	tab_rename:{'优质资源1':'尤东风💠优质','量子资源1':'尤东风💠量子','超清无广':'尤东风💠超清','ik资源':'尤东风💠ik'},
	play_parse: true,
	lazy: `js:
		var html = JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);
		var url = html.url;
		if (html.encrypt == '1') {
			url = unescape(url)
		} else if (html.encrypt == '2') {
			url = unescape(base64Decode(url))
		}
		if (/\\.m3u8|\\.mp4/.test(url)) {
			input = {
				jx: 0,
				url: url,
				parse: 0
			}
		} else {
			input
		}
	`,
	filter: 
	{
        "2": [ 
			  {"key":"class","name":"剧情","value":
				  [
				   {"n":"全部","v":""},{"n":"动作","v":"动作"},{"n":"犯罪","v":"犯罪"},{"n":"历史","v":"历史"},{"n":"古装","v":"古装"},
				   {"n":"爱情","v":"爱情"},{"n":"科幻","v":"科幻"},{"n":"奇幻","v":"奇幻"},{"n":"悬疑","v":"悬疑"},{"n":"剧情","v":"剧情"},
				   {"n":"警匪","v":"警匪"},{"n":"喜剧","v":"喜剧"},{"n":"枪战","v":"枪战"},{"n":"武侠","v":"武侠"},
				   {"n":"战争","v":"战争"}
			      ]
			   },
			  {"key": "year","name": "年份","value": 
			    [
				 {"n": "全部","v": ""},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			    ]
			  }
	       ],
        "1": [
			    {"key":"class","name":"剧情","value":
				  [
				   {"n":"全部","v":""},{"n":"动作","v":"动作"},{"n":"犯罪","v":"犯罪"},{"n":"历史","v":"历史"},{"n":"古装","v":"古装"},
				   {"n":"爱情","v":"爱情"},{"n":"科幻","v":"科幻"},{"n":"奇幻","v":"奇幻"},{"n":"悬疑","v":"悬疑"},{"n":"剧情","v":"剧情"},
				   {"n":"警匪","v":"警匪"},{"n":"喜剧","v":"喜剧"},{"n":"枪战","v":"枪战"},{"n":"武侠","v":"武侠"},{"n":"战争","v":"战争"}
			      ]
			    }, 
			    {"key": "year","name": "年份","value": 
			     [
				 {"n": "全部","v": ""},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			     ]
			    }
	        ],
        "3": [ {"key": "year","name": "年份","value": 
			     [
				 {"n": "全部","v": ""},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			     ]
			   }
	        ],
        "4": [ {"key": "year","name": "年份","value": 
			     [
				 {"n": "全部","v": ""},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			     ]
			    }
	         ],
		"14": [
			   {"key":"class","name":"剧情","value":
				  [
				   {"n":"全部","v":""},{"n":"动作","v":"动作"},{"n":"犯罪","v":"犯罪"},{"n":"历史","v":"历史"},{"n":"古装","v":"古装"},
				   {"n":"爱情","v":"爱情"},{"n":"科幻","v":"科幻"},{"n":"奇幻","v":"奇幻"},{"n":"悬疑","v":"悬疑"},{"n":"剧情","v":"剧情"},
				   {"n":"警匪","v":"警匪"},{"n":"喜剧","v":"喜剧"},{"n":"枪战","v":"枪战"},{"n":"武侠","v":"武侠"},
				   {"n":"战争","v":"战争"}
			      ]
			   },
			   {"key": "year","name": "年份","value": 
			     [
				 {"n": "全部","v": ""},{"n": "2024","v": "2024"},{"n": "2023","v": "2023"},{"n": "2022","v": "2022"},
				 {"n": "2021","v": "2021"},
				 {"n": "2020","v": "2020"},{"n": "2019","v": "2019"},{"n": "2018","v": "2018"},{"n": "2017","v": "2017"},
				 {"n": "2016","v": "2016"},{"n": "2015","v": "2015"},{"n": "2014","v": "2014"},{"n": "2013","v": "2013"},
				 {"n": "2012","v": "2012"},{"n": "2011","v": "2011"},{"n": "2010","v": "2010"}
			     ]
			    }
	         ]
    },
}
